RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_pwr_ex.c
  /* Enable VDDA booster */
  SET_BIT(PWR->PMCR, PWR_PMCR_BOOSTE);
}

/**
  * @brief Disable the analog booster.
  * @retval None.
  */
void HAL_PWREx_DisableAnalogBooster(void)
{
  /* Disable VDDA booster */
  CLEAR_BIT(PWR->PMCR, PWR_PMCR_BOOSTE);

  /* Disable the Analog voltage */
  CLEAR_BIT(PWR->PMCR, PWR_PMCR_AVD_READY);
}

/**
  * @brief  This function handles the PWR PVD/AVD interrupt request.
  * @note   This API should be called under the PVD_AVD_IRQHandler().
  * @note   The use of this API is when the PVD and AVD are activated at the same time.
  * @retval None
  */
void HAL_PWREx_PVD_AVD_IRQHandler(void)
{
  /* Check PWR PVD AVD EXTI Rising flag */
  if (__HAL_PWR_PVD_AVD_EXTI_GET_RISING_FLAG() != 0U)
  {
    /* Clear PWR PVD AVD EXTI Rising pending bit */
    WRITE_REG(EXTI->RPR1, PWR_EXTI_LINE_AVD);

    /* PWR PVD AVD Rising interrupt user callback */
    HAL_PWREx_PVD_AVD_Rising_Callback();
  }

  /* Check PWR PVD AVD EXTI Falling flag */
  if (__HAL_PWR_PVD_AVD_EXTI_GET_FALLING_FLAG() != 0U)
  {
    /* Clear PWR PVD AVD EXTI Falling pending bit */
    WRITE_REG(EXTI->FPR1, PWR_EXTI_LINE_AVD);

    /* PWR PVD AVD Falling interrupt user callback */
    HAL_PWREx_PVD_AVD_Falling_Callback();
  }
}

/**
  * @brief PWR PVD AVD Rising interrupt callback.
  * @retval None.
  */
__weak void HAL_PWREx_PVD_AVD_Rising_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_AVDCallback can be implemented in the user file
  */
}

/**
  * @brief PWR PVD AVD Falling interrupt callback.
  * @retval None.
  */
__weak void HAL_PWREx_PVD_AVD_Falling_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_PWR_AVDCallback can be implemented in the user file
  */
}
/**
  * @}
  */

/** @defgroup PWREx_Exported_Functions_Group3 Wakeup Pins configuration Functions
  * @brief    Wakeup Pins configuration functions
  *
@verbatim
 ===============================================================================
                     ##### Wakeup Pins configuration Functions #####
 ===============================================================================
    [..]
@endverbatim
  * @{
  */

/**
  * @brief Enable the Wake-up PINx functionality.
  * @param  sPinParams : Pointer to a PWREx_WakeupPinTypeDef structure that
  *                      contains the configuration information for the wake-up
  *                      Pin.
  * @retval None.
  */
void HAL_PWREx_EnableWakeUpPin(const PWREx_WakeupPinTypeDef *sPinParams)
{
  uint32_t pinConfig;
  uint32_t regMask;
  const uint32_t pullMask = PWR_WUCR_WUPPUPD1;

  /* Check the parameters */
  assert_param(IS_PWR_WAKEUP_PIN(sPinParams->WakeUpPin));
  assert_param(IS_PWR_WAKEUP_PIN_POLARITY(sPinParams->PinPolarity));
  assert_param(IS_PWR_WAKEUP_PIN_PULL(sPinParams->PinPull));

  pinConfig = sPinParams->WakeUpPin | \
              (sPinParams->PinPolarity << ((POSITION_VAL(sPinParams->WakeUpPin) + PWR_WUCR_WUPP1_Pos) & 0x1FU)) | \
              (sPinParams->PinPull << (((POSITION_VAL(sPinParams->WakeUpPin) * PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET) \
                                        + PWR_WUCR_WUPPUPD1_Pos) & 0x1FU));

  regMask   = sPinParams->WakeUpPin | \
              (PWR_WUCR_WUPP1 << (POSITION_VAL(sPinParams->WakeUpPin) & 0x1FU)) | \
              (pullMask << ((POSITION_VAL(sPinParams->WakeUpPin) * PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET) & 0x1FU));

  /* Enable and Specify the Wake-Up pin polarity and the pull configuration
     for the event detection (rising or falling edge) */
  MODIFY_REG(PWR->WUCR, regMask, pinConfig);
}

/**
  * @brief Disable the Wake-up PINx functionality.
  * @param  WakeUpPinx : Specifies the Wake-Up pin to be disabled.
  *          This parameter can be one of the following values:
  *           @arg PWR_WAKEUP_PIN1
  *           @arg PWR_WAKEUP_PIN2
  *           @arg PWR_WAKEUP_PIN3
  *           @arg PWR_WAKEUP_PIN4
  *           @arg PWR_WAKEUP_PIN5
  *           @arg PWR_WAKEUP_PIN6
  *           @arg PWR_WAKEUP_PIN7
  *           @arg PWR_WAKEUP_PIN8
  * @note   The PWR_WAKEUP_PIN6, PWR_WAKEUP_PIN7 and PWR_WAKEUP_PIN8 are not available for
  *         STM32H503xx devices.
  * @retval None
  */
void HAL_PWREx_DisableWakeUpPin(uint32_t WakeUpPinx)
{
  /* Check the parameter */
  assert_param(IS_PWR_WAKEUP_PIN(WakeUpPinx));

  /* Disable the WakeUpPin */
  CLEAR_BIT(PWR->WUCR, (PWR_WUCR_WUPEN & WakeUpPinx));
}

/**
  * @}
  */

/** @defgroup PWREx_Exported_Functions_Group4 Memories Retention Functions
  * @brief    Memories retention functions
  *
@verbatim
 ===============================================================================
                     ##### Memories Retention Functions #####
 ===============================================================================
    [..]
@endverbatim
  * @{
  */

/**
  * @brief Enable the Flash Power Down in Stop mode.
  * @note   When Flash Power Down is enabled  the Flash memory enters low-power
  *         mode. This feature allows to
  *         obtain the best trade-off between low-power consumption and restart
  *         time when exiting from Stop mode.
  * @retval None.
  */
void HAL_PWREx_EnableFlashPowerDown(void)
{
  /* Enable the Flash Power Down */
  SET_BIT(PWR->PMCR, PWR_PMCR_FLPS);
}

/**
  * @brief Disable the Flash Power Down in Stop mode.
  * @note   When Flash Power Down is disabled  the Flash memory is kept on
  *         normal mode. This feature allows
  *         to obtain the best trade-off between low-power consumption and
  *         restart time when exiting from Stop mode.
  * @retval None.
  */
void HAL_PWREx_DisableFlashPowerDown(void)
{
  /* Disable the Flash Power Down */
  CLEAR_BIT(PWR->PMCR, PWR_PMCR_FLPS);
}

/**
  * @brief Enable memory block shut-off in Stop mode
  * @note   In Stop mode, the content of the memory blocks is
  *         maintained. Further power optimization can be obtained by switching
  *         off some memory blocks. This optimization implies loss of the memory
  *         content. The user can select which memory is discarded during STOP
  *         mode by means of xxSO bits.
  * @param  MemoryBlock : Specifies the memory block to shut-off during Stop mode.
  *          This parameter can be one of the following values:
  *            @arg PWR_ETHERNET_MEMORY_BLOCK PWR_PMCR_ETHERNETSO    : Ethernet shut-off control in Stop mode
  *            @arg PWR_RAM3_MEMORY_BLOCK     PWR_PMCR_SRAM3SO       : RAM3 shut-off control in Stop mode
  *            @arg PWR_RAM2_16_MEMORY_BLOCK  PWR_PMCR_SRAM2_16SO    : RAM2 16k byte shut-off control in Stop mode
  *            @arg PWR_RAM2_48_MEMORY_BLOCK  PWR_PMCR_SRAM2_48SO    : RAM2 48k byte shut-off control in Stop mode
  *            @arg PWR_RAM1_MEMORY_BLOCK     PWR_PMCR_SRAM1SO       : RAM1 shut-off control in Stop mode
  * @note   The PWR_ETHERNET_MEMORY_BLOCK is not available for STM32H503xx devices.
  * @retval None.
  */
void HAL_PWREx_EnableMemoryShutOff(uint32_t MemoryBlock)
{
  /* Check the parameter */
  assert_param(IS_PWR_MEMORY_BLOCK(MemoryBlock));

  /* Enable memory block shut-off */
  SET_BIT(PWR->PMCR, MemoryBlock);
}

/**
  * @brief Disable memory block shut-off in Stop mode
  * @param  MemoryBlock : Specifies the memory block to keep content during
  *                       Stop mode.
  *          This parameter can be one of the following values:
  *            @arg PWR_ETHERNET_MEMORY_BLOCK PWR_PMCR_ETHERNETSO    : Ethernet shut-off control in Stop mode
  *            @arg PWR_RAM3_MEMORY_BLOCK     PWR_PMCR_SRAM3SO       : RAM3 shut-off control in Stop mode
  *            @arg PWR_RAM2_16_MEMORY_BLOCK  PWR_PMCR_SRAM2_16SO    : RAM2 16k byte shut-off control in Stop mode
  *            @arg PWR_RAM2_48_MEMORY_BLOCK  PWR_PMCR_SRAM2_48SO    : RAM2 48k byte shut-off control in Stop mode
  *            @arg PWR_RAM1_MEMORY_BLOCK     PWR_PMCR_SRAM1SO       : RAM1 shut-off control in Stop mode
  * @note   The PWR_ETHERNET_MEMORY_BLOCK is not available for STM32H503xx devices.
  * @retval None.
  */
void HAL_PWREx_DisableMemoryShutOff(uint32_t MemoryBlock)
{
  /* Check the parameter */
  assert_param(IS_PWR_MEMORY_BLOCK(MemoryBlock));

