RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_pwr_ex.c
  /* Disable memory block shut-off */
  CLEAR_BIT(PWR->PMCR, MemoryBlock);
}

/**
  * @brief  Enable the Backup RAM retention in Standby and VBAT modes.
  * @note   If BREN is reset, the backup RAM can still be used in Run, Sleep and
  *         Stop modes. However, its content is lost in Standby, Shutdown and
  *         VBAT modes. This bit can be writte
  * @retval None.
  */
HAL_StatusTypeDef HAL_PWREx_EnableBkupRAMRetention(void)
{
  SET_BIT(PWR->BDCR, PWR_BDCR_BREN);

  return HAL_OK;
}

/**
  * @brief  Disable the Backup RAM retention in Standby and VBAT modes.
  * @note   If BREN is reset, the backup RAM can still be used in Run, Sleep and
  *         Stop modes. However, its content is lost in Standby, Shutdown and
  *         VBAT modes. This bit can be write
  * @retval None.
  */
void HAL_PWREx_DisableBkupRAMRetention(void)
{
  CLEAR_BIT(PWR->BDCR, PWR_BDCR_BREN);
}
/**
  * @}
  */

/** @defgroup PWREx_Exported_Functions_Group5 IO and JTAG Retention Functions
  * @brief    IO and JTAG Retention functions
  *
@verbatim
 ===============================================================================
                     ##### IO and JTAG Retention Functions #####
 ===============================================================================
    [..]
      In the Standby mode, the I/Os are by default in floating state. If the IORETEN bit in the
      PWR_IORETR register is set, the I/Os output state is retained. IO Retention mode is
      enabled for all IO except the IO support the standby functionality and JTAG IOs (PA13,
      PA14, PA15 and PB4). When entering into Standby mode, the state of the output is
      sampled, and pull-up or pull-down resistor are set to maintain the IO output during Standby
      mode.
      If the JTAGIORETEN bit in the PWR_IORETR register is set, the I/Os output state is
      retained. IO Retention mode is enabled for PA13, PA14, PA15 and PB4 (default JTAG pullup/
      pull-down after wakeup are not enabled).
@endverbatim
  * @{
  */

/**
  * @brief Enable GPIO state retention in Standby mode.
  * @note   When entering into standby mode, the output is sampled, and applied to the output IO during
  *         the standby power mode
  * @retval None.
  */
void HAL_PWREx_EnableStandbyIORetention(void)
{
  /* Enable GPIO state retention */
  SET_BIT(PWR->IORETR, PWR_IORETR_IORETEN);
}

/**
  * @brief Disable GPIO state retention in Standby mode.
  * @retval None.
  */
void HAL_PWREx_DisableStandbyIORetention(void)
{
  /* Disable GPIO state retention */
  CLEAR_BIT(PWR->IORETR, PWR_IORETR_IORETEN);
}

/**
  * @brief  Enable JTAG IOs state retention in Standby mode.
  * @note   when entering into standby mode, the output is sampled, and applied to the output IO during
  *         the standby power mode
  * @retval None.
  */
void HAL_PWREx_EnableStandbyJTAGIORetention(void)
{
  /* Enable JTAG IOs state retention */
  SET_BIT(PWR->IORETR, PWR_IORETR_JTAGIORETEN);
}

/**
  * @brief Disable JTAG IOs state retention in Standby mode.
  * @retval None.
  */
void HAL_PWREx_DisableStandbyJTAGIORetention(void)
{
  /* Enable JTAG IOs state retention */
  CLEAR_BIT(PWR->IORETR, PWR_IORETR_JTAGIORETEN);
}

/**
  * @}
  */
#endif /* defined (HAL_PWR_MODULE_ENABLED) */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
